/**
	AOK Trigger Studio (See aokts.cpp for legal conditions.)
	WINDOWS VERSION
	scen_const.cpp -- Defines various scenario constants in scen.h

	MODEL
**/

#include "scen_const.h"

size_t MapSizes[] =
{
	120,	//Tiny
	144,	//Small
	168,	//Medium
	200,	//Normal
	220,	//Large
	240,	//Giant
	255,	//Max
	480		//Ludakris
};

size_t Elevations[] =
{
	0,
	1,
	2,
	3,
	4,
	5,
	6,
	7,
	8
};

const char *message_names[] =
{
	"场景指南", "提示", "胜利", "失败", "历史", "侦察"
};

const char *cinem_names[] =
{
	"开场动画", "胜利动画", "失败动画", "信息背景"
};

const char *difficulties_18[] =
{
	"最易", "标准", "中等", "难", "极难"
};

const char *difficulties_21[] =
{
	"最易", "标准", "中等", "难", "极难"
};

const struct PAIR ages[] =
{
	{ -1, "" },
	{  0, "黑暗" },
	{  1, "封建" },
	{  2, "城堡" },
	{  3, "帝王" },
	{  4, "后帝王" }
};

const struct PAIR ages_hd6[] =
{
	{ -1, "封建" },
	{  0, "黑暗" },
	{  1, "封建" },
	{  2, "城堡" },
	{  3, "城堡" },
	{  4, "城堡" },
	{  5, "帝王" },
	{  6, "后帝王" }
};

const struct PAIR groups[] =
{
	{ -1, "无" },
	{  0, "弓兵" },
	{  1, "文物" },
	{  2, "商船" },
	{  3, "建筑" },
	{  4, "村民" },
	{  5, "海洋鱼类" },
	{  6, "步兵" },
	{  7, "浆果丛" },
	{  8, "石矿" },
	{  9, "被捕食动物" },
	{ 10, "攻击性动物" },
	{ 11, "其他/死亡/投射物" },
	{ 12, "骑兵" },
	{ 13, "攻城武器" },
	{ 14, "地形物" },
	{ 15, "树木" },
	{ 16, "树桩" },
	{ 17, "? 治疗者" },
	{ 18, "僧侣" },
	{ 19, "贸易车" },
	{ 20, "运输船" },
	{ 21, "渔船" },
	{ 22, "战船" },
	{ 23, "征服者/飞镖骑兵" },
	{ 24, "RoR:战象" },
	{ 25, "RoR:英雄" },
	{ 26, "RoR:象射手" },
	{ 27, "城墙" },
	{ 28, "RoR:方阵兵" },
	{ 29, "RoR:驯化动物" },
	{ 30, "旗帜" },
	{ 31, "RoR:深海鱼类" },
	{ 32, "金矿" },
	{ 33, "沿海鱼类" },
	{ 34, "悬崖" },
	{ 35, "破坏者" },
	{ 36, "骑射手" },
	{ 37, "海豚" },
	{ 38, "飞天犬" },
	{ 39, "城门" },
	{ 40, "废墟" },
	{ 41, "资源堆" },
	{ 42, "圣物" },
	{ 43, "持物僧侣" },
	{ 44, "火枪兵" },
	{ 45, "? 双手剑士" },
	{ 46, "? 长枪兵" },
	{ 47, "斥候骑兵" },
	{ 48, "矿石" },
	{ 49, "农田/渔网" },
	{ 50, "? 长矛兵" },
	{ 51, "打包单位" },
	{ 52, "高塔" },
	{ 53, "登舰船" },
	{ 54, "解包单位" },
	{ 55, "弩炮" },
	{ 56, "袭击者" },
	{ 57, "袭击骑兵" },
	{ 58, "牲畜" },
	{ 59, "国王" },
	{ 60, "? 杂项建筑" },
	{ 61, "可控动物" },
};

const struct PAIR utypes[] =
{
	{ -1, "无" },
	{  0, "其他" },
	{  1, "野猪" },
	{  2, "建筑" },
	{  3, "平民" },
	{  4, "军事" },
	{  5, "持物僧侣" }
};

bool isHD(Game game) {
    return game == AOHD || game == AOF || game == AOHD4 || game == AOF4 || game == AOHD6 || game == AOF6;
}

bool isAOE2(Game game) {
    return game == AOK || game == AOC || game == UP || game == ETP || isHD(game);
}
